       IDENTIFICATION DIVISION.
       PROGRAM-ID. PVADDREG.
       AUTHOR. TRONCOSO LEANDRO.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT FICH-SEQ ASSIGN TO ENTRADA
           ORGANIZATION IS SEQUENTIAL
           ACCESS IS SEQUENTIAL
           FILE STATUS IS FS-FICH-SEQ.

           SELECT FICH-VSAM ASSIGN TO SALIDA
           ORGANIZATION IS INDEXED
           ACCESS IS RANDOM
           RECORD KEY IS R-FICH-VSAM-LEGAJO
           FILE STATUS IS FS-FICH-VSAM.

           SELECT FICH-ERROR ASSIGN TO ERRORES
           ORGANIZATION IS SEQUENTIAL
           ACCESS IS SEQUENTIAL
           FILE STATUS IS FS-FICH-ERROR.

       DATA DIVISION.
       FILE SECTION.
       FD FICH-SEQ RECORDING MODE IS F
                   DATA RECORD IS R-FICH-SEQ.
       01 R-FICH-SEQ.
          05 R-FICH-SEQ-LEGAJO     PIC X(5).
          05 R-FICH-SEQ-NOMBRE     PIC X(30).
          05 R-FICH-SEQ-NACIMIENT  PIC 9(8).
          05 R-FICH-SEQ-INGRESO    PIC 9(8).
          05 R-FICH-SEQ-CIUDAD     PIC X(26).

       FD FICH-VSAM DATA RECORD IS R-FICH-VSAM.
       01 R-FICH-VSAM.
          05 R-FICH-VSAM-LEGAJO    PIC X(5).
          05 R-FICH-VSAM-NOMBRE    PIC X(30).
          05 R-FICH-VSAM-NACIMIENT PIC 9(8).
          05 R-FICH-VSAM-INGRESO   PIC 9(8).
          05 R-FICH-VSAM-CIUDAD    PIC X(26).

       FD FICH-ERROR RECORDING MODE IS F
                     DATA RECORD IS R-FICH-ERROR.
       01 R-FICH-ERROR             PIC X(36).

       WORKING-STORAGE SECTION.

       01 FS-FICH-SEQ              PIC 99.
          88 FS-FICH-SEQ-OK        VALUE 00.
          88 FS-FICH-SEQ-END       VALUE 10.

       01 FS-FICH-VSAM             PIC 99.
          88 FS-FICH-VSAM-EXIST    VALUE 22.

       01 FS-FICH-ERROR            PIC 99.

       01 WS-FICH-ERROR.
          05 WS-FICH-ERROR-ACTION   PIC X.
          05 WS-FICH-ERROR-LEGAJO   PIC X(5).
          05 WS-FICH-ERROR-MENSAJE  PIC X(30).

       PROCEDURE DIVISION.

       0100-INIT-PROGRAM.
           PERFORM 0200-OPEN-FILE
           PERFORM 0300-MIGRATION-FILE UNTIL FS-FICH-SEQ-END
           PERFORM 0400-CLOSE-FILE
           PERFORM 0500-EXIT-PROGRAM.

       0200-OPEN-FILE.
           OPEN INPUT FICH-SEQ
           OPEN OUTPUT FICH-VSAM
           OPEN OUTPUT FICH-ERROR.

       0300-MIGRATION-FILE.
           READ FICH-SEQ
           MOVE R-FICH-SEQ TO R-FICH-VSAM
           WRITE R-FICH-VSAM
           IF FS-FICH-VSAM-EXIST THEN
              MOVE 'A' TO WS-FICH-ERROR-ACTION
              MOVE R-FICH-SEQ-LEGAJO TO WS-FICH-ERROR-LEGAJO
              MOVE 'REGISTRO DUPLICADO' TO WS-FICH-ERROR-MENSAJE
              MOVE WS-FICH-ERROR TO R-FICH-ERROR
              WRITE R-FICH-ERROR
           END-IF.

       0400-CLOSE-FILE.
           CLOSE FICH-SEQ
           CLOSE FICH-VSAM
           CLOSE FICH-ERROR.

       0500-EXIT-PROGRAM.
           STOP RUN.
