       IDENTIFICATION DIVISION.
       PROGRAM-ID. PVDELREG.
       AUTHOR. TRONCOSO LEANDRO.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

           SELECT FICH-DEL ASSIGN TO ENTRADA
           ORGANIZATION IS SEQUENTIAL
           ACCESS IS SEQUENTIAL
           FILE STATUS IS FS-FICH-DEL.

           SELECT FICH-VSAM ASSIGN TO SALIDA
           ORGANIZATION IS INDEXED
           ACCESS IS RANDOM
           RECORD KEY IS R-FICH-VSAM-LEGAJO
           FILE STATUS IS FS-FICH-VSAM.

           SELECT FICH-ERROR ASSIGN TO ERRORES
           ORGANIZATION IS SEQUENTIAL
           ACCESS IS SEQUENTIAL
           FILE STATUS IS FS-FICH-ERROR.

       DATA DIVISION.
       FILE SECTION.

       FD FICH-DEL RECORDING MODE IS F
                   DATA RECORD IS R-FICH-DEL.
       01 R-FICH-DEL.
          05 R-FICH-DEL-LEGAJO     PIC X(5).
          05 R-FICH-DEL-NOMBRE     PIC X(30).
          05 R-FICH-DEL-NACIMIENT  PIC 9(8).
          05 R-FICH-DEL-INGRESO    PIC 9(8).
          05 R-FICH-DEL-CIUDAD     PIC X(26).

       FD FICH-VSAM DATA RECORD IS R-FICH-VSAM.
       01 R-FICH-VSAM.
          05 R-FICH-VSAM-LEGAJO     PIC X(5).
          05 R-FICH-VSAM-NOMBRE     PIC X(30).
          05 R-FICH-VSAM-NACIMIENT  PIC 9(8).
          05 R-FICH-VSAM-INGRESO    PIC 9(8).
          05 R-FICH-VSAM-CIUDAD     PIC X(26).

       FD FICH-ERROR RECORDING MODE IS F
                     DATA RECORD R-FICH-ERROR.
       01 R-FICH-ERROR              PIC X(36).

       WORKING-STORAGE SECTION.

       01 FS-FICH-VSAM              PIC 99.
          88 FS-FICH-VSAM-NEXIST    VALUE 23.

       01 FS-FICH-DEL               PIC 99.
          88 FS-FICH-DEL-OK         VALUE 00.
          88 FS-FICH-DEL-END        VALUE 10.

       01 FS-FICH-ERROR             PIC 99.

       01 WS-ERROR.
          05 WS-ERROR-ACTION        PIC X.
          05 WS-ERROR-LEGAJO        PIC X(5).
          05 WS-ERROR-MENSAJE       PIC X(30).


       PROCEDURE DIVISION.
       0100-MAIN-PROGRAM.
           PERFORM 0200-OPEN-FILE
           PERFORM 0300-DELETE-RECORD UNTIL FS-FICH-DEL-END
           PERFORM 0400-CLOSE-FILE
           PERFORM 0500-CLOSE-PROGRAM.

       0200-OPEN-FILE.
           OPEN INPUT FICH-DEL
           OPEN I-O FICH-VSAM
           OPEN EXTEND FICH-ERROR.

       0300-DELETE-RECORD.
           READ FICH-DEL
           MOVE R-FICH-DEL TO R-FICH-VSAM
           READ FICH-VSAM
           IF FS-FICH-VSAM-NEXIST THEN
              MOVE 'D' TO WS-ERROR-ACTION
              MOVE R-FICH-DEL-LEGAJO TO WS-ERROR-LEGAJO
              MOVE 'NO EXISTE EL LEGAJO A ELIMINAR' TO WS-ERROR-MENSAJE
              WRITE R-FICH-ERROR FROM WS-ERROR
           ELSE
              MOVE R-FICH-DEL TO R-FICH-VSAM
              DELETE FICH-VSAM
           END-IF.

       0400-CLOSE-FILE.
           CLOSE FICH-DEL
           CLOSE FICH-VSAM
           CLOSE FICH-ERROR.

       0500-CLOSE-PROGRAM.
           STOP RUN.
