       IDENTIFICATION DIVISION.
       PROGRAM-ID. PVMODREG.
       AUTHOR. TRONCOSO LEANDRO.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT  SECTION.
       FILE-CONTROL.
           SELECT FICH-MOD ASSIGN TO ENTRADA
           ORGANIZATION IS SEQUENTIAL
           ACCESS IS SEQUENTIAL
           FILE STATUS IS FS-FICH-MOD.

           SELECT FICH-VSAM ASSIGN TO SALIDA
           ORGANIZATION IS INDEXED
           ACCESS IS RANDOM
           RECORD KEY IS R-FICH-VSAM-LEGAJO
           FILE STATUS IS FS-FICH-VSAM.

           SELECT FICH-ERROR ASSIGN TO ERRORES
           ORGANIZATION IS SEQUENTIAL
           ACCESS IS SEQUENTIAL
           FILE STATUS IS FS-FICH-ERROR.

       DATA DIVISION.
       FILE SECTION.
       FD FICH-MOD RECORDING MODE IS F
                   DATA RECORD IS R-FICH-MOD.
       01 R-FICH-MOD.
          05 R-FICH-MOD-LEGAJO     PIC X(5).
          05 R-FICH-MOD-NOMBRE     PIC X(30).
          05 R-FICH-MOD-NACIMIENT  PIC 9(8).
          05 R-FICH-MOD-INGRESO    PIC 9(8).
          05 R-FICH-MOD-CIUDAD     PIC X(26).

       FD FICH-VSAM DATA RECORD IS R-FICH-VSAM.
       01 R-FICH-VSAM.
          05 R-FICH-VSAM-LEGAJO    PIC X(5).
          05 R-FICH-VSAM-NOMBRE    PIC X(30).
          05 R-FICH-VSAM-NACIMIENT PIC 9(8).
          05 R-FICH-VSAM-INGRESO   PIC 9(8).
          05 R-FICH-VSAM-CIUDAD    PIC X(26).

       FD FICH-ERROR RECORDING MODE IS F
                     DATA RECORD IS R-FICH-ERROR.
       01 R-FICH-ERROR             PIC X(30).

       WORKING-STORAGE SECTION.

       01 WS-ERROR.
          05 WS-ERROR-ACTION   PIC X.
          05 WS-ERROR-LEGAJO   PIC X(5).
          05 WS-ERROR-MENSAJE  PIC X(30).

       01 FS-FICH-MOD               PIC 99.
          88 FS-FICH-MOD-OK         VALUE 00.
          88 FS-FICH-MOD-END        VALUE 10.

       01 FS-FICH-VSAM              PIC 99.
          88 FS-FICH-VSAM-NEXISTE   VALUE 23.

       01 FS-FICH-ERROR             PIC 99.

       PROCEDURE DIVISION.
       0100-MAIN-PROGRAM.
           PERFORM 0200-OPEN-FILE
           PERFORM 0300-UPDATE-FILE UNTIL FS-FICH-MOD-END
           PERFORM 0400-CLOSE-FILE
           PERFORM 0500-CLOSE-PROGRAM.

       0200-OPEN-FILE.
           OPEN I-O FICH-VSAM
           OPEN INPUT FICH-MOD
           OPEN EXTEND FICH-ERROR.

       0300-UPDATE-FILE.
           READ FICH-MOD
           MOVE R-FICH-MOD TO R-FICH-VSAM
           READ FICH-VSAM
           IF FS-FICH-VSAM-NEXISTE THEN
             MOVE 'M' TO WS-ERROR-ACTION
             MOVE R-FICH-MOD-LEGAJO TO WS-ERROR-LEGAJO
             MOVE 'LEGAJO NO EXISTE PARA EDITAR' TO WS-ERROR-MENSAJE
             WRITE R-FICH-ERROR FROM WS-ERROR
           ELSE
             MOVE R-FICH-MOD TO R-FICH-VSAM
             REWRITE R-FICH-VSAM
           END-IF.

       0400-CLOSE-FILE.
           CLOSE FICH-VSAM
           CLOSE FICH-MOD
           CLOSE FICH-ERROR.

       0500-CLOSE-PROGRAM.
           STOP RUN.
